Revit 2027 API
ElementIsElementTypeFilter(Boolean) Constructor
 Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIsElementTypeFilter(
	bool inverted
)
Public Sub New (
	inverted As Boolean
)
public:
ElementIsElementTypeFilter(
	bool inverted
)
new :
        inverted : bool -> ElementIsElementTypeFilter
Parameters
inverted Boolean
 True if the filter should match all elements which are not ElementTypes.
See Also
Reference
ElementIsElementTypeFilter Class
ElementIsElementTypeFilter Overload
Autodesk.Revit.DB Namespace